package patterns.creational;


/* ПОРОЖДАЮЩИЕ ПАТТЕРНЫ: Отвечают за удобное и безопасное создание новых объектов или даже целых
 * семейств объектов
 *
 * - абстрактная фабрика (abstract factory): предоставляет интерфейс создания семейств
 * взаимосвязанных продуктов, не привязываясь к конкретным классам создаваемых продуктов
 *
 * - фабричный метод (factory method): определяет общий интерфейс создания объектов в суперклассе,
 * позволяя подклассам изменять тип создаваемых объектов
 *
 * - одиночка (singleton): гарантирует, что класс имеет только 1 экземпляр, и предоставляет
 * глобальную точку доступа к этому экземпляру
 *
 * - строитель (builder): позволяет создавать сложные объекты пошагово. Даёт возможность
 * использовать один и тот же код строительства для получения разных представлений объектов
 *
 * - прототип (prototype): позволяет копировать объекты, не вдаваясь в подробности их реализации */


public class Main {
}
