/* КОНЦЕПТУАЛЬНЫЙ ДИЗАЙН
 * - использует объектно-ориентированный анализ
 *      - чтобы выделить ключевые объекты (модели) в проблемной области и разделить их на части
 *
 * - основывается на требованиях
 *      - желательно делать перед техническим дизайном
 *          - на этапе технического дизайна будет описание того, КАК компонент реализует обязанности
 *
 * - является высокоуравневым и неточным
 *
 * - реализуется при помощи:
 *     - графических набросков/макетов
 *     - и CRC карт
 *
 * - изображает:
 *      - компоненты
 *      - их связи
 *      - их ответственности */