/* МОДЕЛИРОВАНИЕ ОБЪЕКТОВ
 * - выделение объектов в проблемной области при помощи объектно-ориентрированного анализа
 *
 * - перенос их в:
 *      - CRC карты
 *      - затем в UML */


/* КАТЕГОРИИ ОБЪЕКТОВ
 * - объект-сущность
 *      - модель из проблемной области
 *      - статус: выделение объектов в проблемной области
 *
 * - объект-контроллер
 *      - модель из проблемной области
 *          - получает события
 *          - координирует действия
 *      - статус: процесс двигается в область решения
 *
 * - пограничный объект
 *      - модель из проблемной области
 *          - подключает внешние сервисы к системе
 *      - статус: процесс двигается в область решения */