package patterns;

/* КЛЮЧЕВЫЕ МОМЕНТЫ
 * - знание основ ООП не делает из вас хорошего ОО-проектировщика
 *
 * - хорошие ОО-архитектуры хорошо расширяются, просты в сопровождении и пригодны для повторного
 * использования
 *
 * - паттерны показывают, как строить системы с хорошими качествами ОО-проектирования
 *
 * - паттерны содержат проверенный опыт ОО-проектирования
 *
 * - паттерны описывают общие решения проблем проектирования и применяются в конкретных приложениях
 *
 * - паттерны не придумывают - их находят
 *
 * - большинство паттернов и принципов направлено на решение проблем изменения программных архитектур
 *
 * - многие паттерны основаны на инкапсуляции переменных аспектов системы
 *
 * - паттерны образуют единую номенклатуру, которая повышает эффективность вашего общения с другими
 * разработчиками */


public class Main {
}