/* CLASS-RESPONSIBILITY-COLLABORATOR карта
 * - быстрый способ описания моделей в проблемной области
 *
 * - является 1 из реализаций концептуального дизайна
 *      - другой являются макеты
 *
 * - изображается на простых бумажных листках
 *
 * - отображает для компонента:
 *      - его имя (верхний блок)
 *      - его задачи (левый блок)
 *          - в отличие от UML диаграммы класса, задачи включают и атрибуты класса и методы
 *      - другие компоненты, которые нужны для реализации задач (правый блок)
 *
 * - напр.:
 *      - имя:
 *          - Data
 *      - задачи:
 *          - хранение информации
 *      - другие компоненты:
 *          - DataContainer */